# Primeros pasos con Big Query

*1) Conexi√≥n a la base de datos*

In [1]:
from google.colab import auth
auth.authenticate_user()
print('Authenticated')

Authenticated

*2) Declare the Cloud project ID which will be used throughout this notebook*

In [3]:
project_id = 'apt-bonbon-331010'

from google.cloud import bigquery

client = bigquery.Client(project=project_id)

## EJERCICIOS DE CLASE

**Exercise 1. How many different series are there in bls.employment_hours_earnings_series? Use the series_title for doing this.**

In [4]:
query_bls_1 = '''
SELECT COUNT (series_title)
FROM `bigquery-public-data.bls.employment_hours_earnings_series`  
 '''

In [6]:
cosa_auxiliar1 = client.query(query_bls_1) 
df_hacker_1 = cosa_auxiliar1.to_dataframe()

In [7]:
df_hacker_1

     f0_
0  25285

**Exercise 2. How many series are there whose title contains the words weekly, earnings and data? The three of them and in that order.**

In [8]:
query_bls_2 = '''
SELECT DISTINCT series_title
FROM `bigquery-public-data.bls.employment_hours_earnings_series`
WHERE series_title LIKE '%weekly%earnings%data%'
'''

In [10]:
cosa_auxiliar2 = client.query(query_bls_2)
df_hacker_2 = cosa_auxiliar2.to_dataframe()

In [11]:
df_hacker_2

                                        series_title
0  Average weekly earnings of all employees, data...
1  Average weekly earnings of all employees, data...
2  Average weekly earnings of all employees, 1982...
3  Average weekly earnings of all employees, 1982...
4  Average weekly earnings of production and nons...
5  Average weekly earnings of production and nons...
6  Average weekly earnings of production and nons...
7  Average weekly earnings of production and nons...

**Exercise 3. From the table bls.employment_hours_earnings calculate the yearly mean and standard deviation of the series Average weekly earnings of production and nonsupervisory employees, data processing, hosting and related services, seasonally adjusted. Order the result by year.**

In [12]:
query_bls_3 = '''
SELECT AVG(value), STDDEV(value)
FROM `bigquery-public-data.bls.employment_hours_earnings`
WHERE series_title = 'Average weekly earnings of production and nonsupervisory employees, data processing, hosting and related services, seasonally adjusted'
GROUP BY year
ORDER BY year DESC
'''

In [19]:
cosa_auxiliar_3 = client.query(query_bls_3)
cosa_auxiliar_3.to_dataframe()

            f0_        f1_
0   1615.951111  60.236759
1   1469.720000  21.664852
2   1397.097500  44.741704
3   1226.966667  46.800004
4   1241.620000  34.161704
5   1170.021667  29.445497
6   1096.438333  18.554491
7   1133.840833  10.012858
8   1108.400833  10.917092
9   1001.259167  55.838259
10   941.801667  28.128682
11  1020.791667  12.814122
12   944.084167  36.401756
13   867.811667  24.669993
14   816.615000   6.452528
15   762.151667  18.621727
16   734.820833   5.171085
17   745.658333   5.997234
18   732.279167   6.452362
19   699.659167  23.961560
20   642.747500  19.586787
21   611.553333  12.390835
22   567.302500   4.961092
23   561.050833   9.099447
24   536.405000   7.307433
25   503.326667  14.214563
26   482.515000   5.172509
27   472.301667   2.957649
28   466.820833   5.165284
29   453.445000   9.193349
30   423.920833   9.149005
31   407.720000   3.012872

**Exercise 4. Get the yearly average unemployment from the table unemployment_cps and join it to the previous query. The name of the series is (Unadj) Total unemployed plus discouraged workers, as a percent of the civilian labor force plus discouraged workers. The idea is doing one only SQL query. The final table will have four columns: year, average percentage of unemployment, average weekly earnings and std of weekly earnings.**

In [15]:
query_bls_4 = '''
SELECT AVG(value)
FROM `bigquery-public-data.bls.unemployment_cps`
WHERE series_title = '(Unadj) Total unemployed plus discouraged workers, as a percent of the civilian labor force plus discouraged workers'
'''

In [16]:
cosa_auxiliar4 = client.query(query_bls_4)
df_hacker_4 = cosa_auxiliar4.to_dataframe()

In [18]:
df_hacker_4

        f0_
0  6.129979